# Foundation of Python Programming

This file is a foundation of Python programming notes during Home Credit Indonesia Data Science Academy 2019

Author: Bernardus Ari Kuncoro 
<br> Date: 23 October 2019

## Outline 
### Session 1: Intro, Arithmetic, List, Function, Method, Loop 
### Session 2: np-Array, Dictionary, pd-Dataframe
### Session 3: Data Cleansing 
### Session 4: Use Case and Exercise

Website of Home Credit Indonesia is [here](https://www.homecredit.co.id).

Website of Home Credit Indonesia is [here](https://www.homecredit.co.id "Silakan klik untuk kunjungi web Home Credit Indonesia").

* * *

***

The participants of HCI Data Science Academy are: 
    
1. Tri
    1. **Major**: __Mathematics__ 
        1. *Minor: Pure Mathematics*
    2. **Hobby**: _Watching YouTube_
2. Mike 
    1. **_Major: Computer Science_** 
    2. Hobby: Bowling
3. Andre 
4. Gunawan
5. Billy 
6. Joshua
7. Gilang 
8. Nirta 
9. Herdis 
10. Samuel 
11. Haries 
12. Rangga 
13. Hari 
14. Okky

![Gambar HCI](hci_logo.png)

In [8]:
from platform import python_version
print(python_version())

3.6.8

In [9]:
apel = 8 
apel_malang = 10

In [10]:
import math

In [11]:
math.sqrt(4)

2.0

In [13]:
import pandas as pd 
code = ['US', 'AUS', 'JPN', 'IN', 'RUS', 'MOR', 'EG']
names = ['United States', 'Australia', 'Japan', 'India', 'Russia','Morocco', 'Egypt']
dr = [True, False, False, False, True, True, True]
cpc = [809, 731, 588, 18, 200, 70, 45]

# Create dictionary my_dict with three key:value pairs: my_dict
my_dict = {'ctrcode':code, 'country':names, 'drives_right':dr, 'cars_per_cap':cpc}

cars = pd.DataFrame(my_dict)

print(type(cars))
print(cars)

# Set DF Column Index
cars_id = cars.set_index("ctrcode")
print(cars_id.shape)
cars_id

<class 'pandas.core.frame.DataFrame'>
  ctrcode        country  drives_right  cars_per_cap
0      US  United States          True           809
1     AUS      Australia         False           731
2     JPN          Japan         False           588
3      IN          India         False            18
4     RUS         Russia          True           200
5     MOR        Morocco          True            70
6      EG          Egypt          True            45
(7, 3)

               country  drives_right  cars_per_cap
ctrcode
US       United States          True           809
AUS          Australia         False           731
JPN              Japan         False           588
IN               India         False            18
RUS             Russia          True           200
MOR            Morocco          True            70
EG               Egypt          True            45

In [14]:
cars_id[0:3]

               country  drives_right  cars_per_cap
ctrcode
US       United States          True           809
AUS          Australia         False           731
JPN              Japan         False           588

In [31]:
cars_id[['country']]

               country
ctrcode
US       United States
AUS          Australia
JPN              Japan
IN               India
RUS             Russia
MOR            Morocco
EG               Egypt

In [32]:
import pandas as pd

In [36]:
imdb = pd.read_csv('https://raw.githubusercontent.com/scalabretta/GroupProject--IMDB/master/Dataset/IMDB-database-update.csv',encoding='latin1')

In [37]:
imdb.head()

,movie_ID,movie_title,duration,color,title_year,country,language,content_rating,budget_USD,gross_USD,...,actor_3_facebook?,actor_3_facebook_likes,cast_total_facebook_likes,movie_facebook?,movie_facebook_likes;,facenumber_in_poster,num_voted_users,num_user_for_reviews,imdb_score,imdb_top_250
0,1,Avatar,178,1,2009,USA,English,PG-13,237000000,760505847,...,1,855,4834,1,33000,0,886204,3054,7.9,0
1,2,Pirates of the Caribbean: At World's End,169,1,2007,USA,English,PG-13,300000000,309404152,...,1,1000,48350,0,0,0,471220,1238,7.1,0
2,3,The Dark Knight Rises,164,1,2012,USA,English,PG-13,250000000,448130642,...,1,23000,106759,1,164000,0,1144337,2701,8.5,1
3,4,Spider-Man 3,156,1,2007,USA,English,PG-13,258000000,336530303,...,1,4000,46055,0,0,0,383056,1902,6.2,0
4,5,Batman v Superman: Dawn of Justice,183,1,2016,USA,English,PG-13,250000000,330249062,...,1,2000,24450,1,197000,0,371639,3018,6.9,0